In [20]:
import pandas as pd

In [21]:
sample = pd.read_csv("data/sample.csv")

In [4]:
columns = sample.columns

In [5]:
print(columns)

Index(['Name', 'City', 'Age', 'Profession'], dtype='object')

In [6]:
sample.columns = ['name','city','age','profession']

In [7]:
sample.name.unique()

array(['Иванов', nan, 'sidorov', '_______', 'Кузнецов', 'Сажин',
       'Котлеревский', 'Завалишина', 'Левина', 'Фикс'], dtype=object)

In [8]:
sample.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        10 non-null     object
 1   city        10 non-null     object
 2   age         11 non-null     int64
 3   profession  11 non-null     object
dtypes: int64(1), object(3)
memory usage: 480.0+ bytes

In [13]:
sample2 = sample[(sample['age'] < 30) & (sample['profession'] == 'Рабочий')]

In [14]:
sample2

       name    city  age profession
5  Кузнецов    Сочи   19    Рабочий
6     Сажин  Сургут   29    Рабочий

In [18]:
sample[sample.name.str.match("К", na=False)]

           name        city  age profession
5      Кузнецов        Сочи   19    Рабочий
7  Котлеревский  Йошкар-Ола   32    Рабочий

In [19]:
sample[~sample.name.str.match("К", na=False)]

          name         city  age profession
0       Иванов       Москва   25     Клинер
1          NaN    Волгоград   31   Менеджер
2       Иванов       Москва   25     Клинер
3      sidorov  Владивосток   43   Менеджер
4      _______        Курск   50   Водитель
6        Сажин       Сургут   29    Рабочий
8   Завалишина    Чебоксары   36   Менеджер
9       Левина          NaN   55    Рабочий
10        Фикс         Рига   42    Рабочий

In [24]:
sample3 = sample[sample.City.str.contains("о", na=False)]

In [25]:
sample4 = sample[~sample.City.str.contains("о", na=False)]

In [30]:
sample2 = sample.copy()
sample2['Age'] = sample.Age.apply(lambda x:x+1)

In [32]:
sample2['City'] = sample.City.apply(lambda s: str(s).lower())

In [34]:
def profession_code(s):
    if s=="Рабочий":
        return 0
    elif s=="Менеджер":
        return 1
    else:
        return 2

In [39]:
def age_category(age):
    if age < 23:
        return "молодой"
    elif 23 <= age <= 35:
        return "средний"
    else:
        return "зрелый"

In [37]:
sample2['Profession'] = sample.Profession.apply(profession_code)

In [40]:
sample['Age_category'] = sample.Age.apply(age_category)

In [41]:
sample

            Name         City  Age Profession Age_category
0         Иванов       Москва   25     Клинер      средний
1            NaN    Волгоград   31   Менеджер      средний
2         Иванов       Москва   25     Клинер      средний
3        sidorov  Владивосток   43   Менеджер       зрелый
4        _______        Курск   50   Водитель       зрелый
5       Кузнецов         Сочи   19    Рабочий      молодой
6          Сажин       Сургут   29    Рабочий      средний
7   Котлеревский   Йошкар-Ола   32    Рабочий      средний
8     Завалишина    Чебоксары   36   Менеджер       зрелый
9         Левина          NaN   55    Рабочий       зрелый
10          Фикс         Рига   42    Рабочий       зрелый